Monard2033/nRF52840-Receiver/src/main.c
/*
 * The ESB event handler runs in interrupt context. It may use a message queue
 * with K_NO_WAIT, but it must not call the USB HID endpoint API directly.
 */
static bool queue_hid_report(const struct link_input_packet *packet)
{
	if (k_msgq_put(&hid_report_queue, packet, K_NO_WAIT) == 0) {
		return true;
	}

	/* The normal path has enough room for more than 100 ms of 1 kHz input.
	 * If an external USB stall lasts longer than that, discard only the oldest
	 * frame; never purge the queue because that would destroy an ordered
	 * modifier/key/release sequence such as CTRL+C. */
	struct link_input_packet discarded;

	atomic_inc(&hid_queue_overruns);
	if (k_msgq_get(&hid_report_queue, &discarded, K_NO_WAIT) == 0) {
		return k_msgq_put(&hid_report_queue, packet, K_NO_WAIT) == 0;
	}
	return false;
}

static bool sequence_is_newer(uint8_t sequence, uint8_t previous)
{
	return (int8_t)(sequence - previous) > 0;
}

static bool battery_packet_is_valid(const struct link_input_packet *packet)
{
	return packet->data[0] <= 100U && packet->data[1] <= 4U &&
	       (packet->data[5] & 0x01U) != 0U &&
	       (packet->data[5] & 0xF0U) == 0U &&
	       packet->data[6] == 0U && packet->data[7] == 0U;
}

static void battery_cache_update(const struct link_input_packet *packet)
{
	k_spinlock_key_t key = k_spin_lock(&battery_cache_lock);
	bool const newer = !battery_cache_valid ||
		sequence_is_newer(packet->data[4], battery_sequence);

	if (newer) {
		battery_percentage = packet->data[0];
		battery_state = packet->data[1];
		battery_millivolts = (uint16_t)packet->data[2] |
			((uint16_t)packet->data[3] << 8);
		battery_sequence = packet->data[4];
		battery_flags = packet->data[5];
		battery_last_update_ms = k_uptime_get_32();
		battery_cache_valid = true;
	}
	k_spin_unlock(&battery_cache_lock, key);
}

static void receiver_set_led_state(uint8_t led_state)
{
	led_state &= 0x07U;
	k_spinlock_key_t key = k_spin_lock(&led_state_lock);

	if (!windows_led_valid || windows_led_state != led_state) {
		windows_led_state = led_state;
		windows_led_sequence++;
	}
	windows_led_valid = true;
	k_spin_unlock(&led_state_lock, key);

	/* Queue the new Windows state immediately. It will be attached to the
	 * next eligible ESB ACK without waiting for another RX handler cycle. */
	atomic_set(&led_ack_pending, 1);
}

static bool receiver_queue_led_ack(void)
{
	struct link_ack_frame ack = {
		.magic = LINK_ACK_MAGIC,
		.version = LINK_VERSION,
		.type = LINK_ACK_TYPE_LOCK_STATE,
	};
	struct esb_payload payload = { 0 };

	k_spinlock_key_t dfu_key = k_spin_lock(&dfu_state_lock);
	if (dfu_ack_active) {
		ack = dfu_pending_ack;
		dfu_ack_active = false;
		k_spin_unlock(&dfu_state_lock, dfu_key);
	} else {
		k_spin_unlock(&dfu_state_lock, dfu_key);
		k_spinlock_key_t key = k_spin_lock(&led_state_lock);
		ack.sequence = windows_led_sequence;
		ack.data[0] = windows_led_state;
		ack.data[1] = (windows_led_valid ? 0x01U : 0x00U) |
			(atomic_cas(&battery_poll_requested, 1, 0) ? 0x02U : 0x00U);
		ack.data[2] = windows_led_epoch;
		k_spin_unlock(&led_state_lock, key);
	}

	payload.length = sizeof(ack);
	payload.pipe = 0;
	payload.noack = false;
	memcpy(payload.data, &ack, sizeof(ack));
	return esb_write_payload(&payload) == 0;
}

static void receiver_ack_task(void)
{
	if (atomic_cas(&led_ack_pending, 1, 0)) {
		(void)receiver_queue_led_ack();
	}
}

static void receiver_esb_event_handler(const struct esb_evt *event)
{
	if (event->evt_id != ESB_EVENT_RX_RECEIVED) {
		return;
	}

	while (esb_read_rx_payload(&esb_rx_payload) == 0) {
		struct link_input_packet packet;

		atomic_inc(&radio_packets);
		atomic_set(&radio_last_rssi, esb_rx_payload.rssi);
		if (esb_rx_payload.length != sizeof(packet)) {
			atomic_inc(&radio_bad_packets);
			continue;
		}

		memcpy(&packet, esb_rx_payload.data, sizeof(packet));

		if (packet.magic != LINK_MAGIC || packet.version != LINK_VERSION) {
			atomic_inc(&radio_bad_packets);
			continue;
		}

		if (packet.type == LINK_TYPE_DFU_STATUS) {
			k_spinlock_key_t key = k_spin_lock(&dfu_state_lock);
			dfu_current_status = packet.data[0];
			dfu_progress_percent = packet.data[1];
			dfu_last_offset_div_4 = (uint16_t)packet.data[2] |
				((uint16_t)packet.data[3] << 8);
			k_spin_unlock(&dfu_state_lock, key);
			atomic_set(&led_ack_pending, 1);
			continue;
		}

		if (packet.type == LINK_TYPE_BATTERY) {
			if (!battery_packet_is_valid(&packet)) {
				atomic_inc(&radio_bad_packets);
				continue;
			}
			battery_cache_update(&packet);
			continue;
		}

		if (packet.type == LINK_TYPE_CONTROL) {
			if (packet.data[0] != LINK_CONTROL_POLL_ACK) {
				atomic_inc(&radio_bad_packets);
				continue;
			}
			continue;
		}

		if (packet.type == LINK_TYPE_KEYBOARD) {
			atomic_set(&last_keyboard_packet_ms, k_uptime_get_32());
		} else if (packet.type == LINK_TYPE_CONSUMER) {
			atomic_set(&last_consumer_packet_ms, k_uptime_get_32());
		}

		bool *previous_valid = packet.type == LINK_TYPE_KEYBOARD ?
			&previous_keyboard_valid : &previous_consumer_valid;
		bool *previous_queue_failed = packet.type == LINK_TYPE_KEYBOARD ?
			&previous_keyboard_queue_failed : &previous_consumer_queue_failed;
		uint8_t *previous_data = packet.type == LINK_TYPE_KEYBOARD ?
			previous_keyboard : previous_consumer;
		uint8_t *previous_sequence = packet.type == LINK_TYPE_KEYBOARD ?
			&previous_keyboard_sequence : &previous_consumer_sequence;
		bool const sequence_newer = !*previous_valid ||
			sequence_is_newer(packet.sequence, *previous_sequence);
		bool const same_sequence_retry = *previous_valid &&
			packet.sequence == *previous_sequence && *previous_queue_failed;

		/*
		 * Keyboard packets are absolute states: if the data is identical to
		 * the current keyboard state, it is a keepalive/duplicate, so drop it
		 * and do NOT re-queue it to Windows.
		 */
		if (*previous_valid && !same_sequence_retry &&
		    packet.type == LINK_TYPE_KEYBOARD &&
		    memcmp(packet.data, previous_data, INPUT_DATA_SIZE) == 0) {
			*previous_sequence = packet.sequence;
			*previous_queue_failed = false;
			atomic_inc(&radio_duplicates);
			continue;
		}

