Monard2033/nRF52840-Receiver/src/main.c
	memcpy(hid_tx_buffer, report, report_size);
	int const err = hid_int_ep_write(hid_device, hid_tx_buffer,
					 report_size, NULL);
	if (err != 0) {
		k_sem_give(&hid_in_idle);
		atomic_inc(&hid_write_errors);
		return err;
	}

	atomic_inc(&hid_reports_sent);
	return 0;
}

static int send_keyboard_report(const uint8_t data[INPUT_DATA_SIZE])
{
	uint8_t report[1U + INPUT_DATA_SIZE];

	report[0] = HID_REPORT_ID_KEYBOARD;
	memcpy(&report[1], data, INPUT_DATA_SIZE);
	return send_hid_report(report, sizeof(report));
}

static int send_consumer_report(const uint8_t data[INPUT_DATA_SIZE])
{
	const uint8_t report[] = {
		HID_REPORT_ID_CONSUMER,
		data[0],
		data[1],
	};

	return send_hid_report(report, sizeof(report));
}

static int usb_hid_initialize(void)
{
	int err;

	hid_device = device_get_binding("HID_0");
	if (hid_device == NULL) {
		return -ENODEV;
	}

	usb_hid_register_device(hid_device, hid_report_descriptor,
				sizeof(hid_report_descriptor), &hid_ops);

	err = usb_hid_init(hid_device);
	if (err != 0) {
		return err;
	}

	return usb_enable(usb_status_callback);
}

#if CONFIG_LOG
static void status_thread(void)
{
	for (;;) {
		k_sleep(K_SECONDS(5));
		LOG_INF("USB=%s ESB=%s init_err=%ld radio=%ld rssi=%ld bad=%ld dup=%ld "
			"queue_drop=%ld HID=%ld err=%ld "
			"RF[state=%lu cfg_ch=%u reg_ch=%lu mode=%lu pipes=0x%02lx] "
			"HF=0x%08lx",
			usb_hid_ready() ? "ready" : "offline",
			atomic_get(&radio_ready) != 0 ? "ready" : "offline",
			(long)atomic_get(&radio_init_error),
			(long)atomic_get(&radio_packets),
			(long)atomic_get(&radio_last_rssi),
			(long)atomic_get(&radio_bad_packets),
			(long)atomic_get(&radio_duplicates),
			(long)atomic_get(&hid_queue_overruns),
			(long)atomic_get(&hid_reports_sent),
			(long)atomic_get(&hid_write_errors),
			(unsigned long)NRF_RADIO->STATE,
			LINK_RF_CHANNEL,
			(unsigned long)NRF_RADIO->FREQUENCY,
			(unsigned long)NRF_RADIO->MODE,
			(unsigned long)NRF_RADIO->RXADDRESSES,
			(unsigned long)NRF_CLOCK->HFCLKSTAT);
	}
}

K_THREAD_DEFINE(status_thread_id, 1024, status_thread,
		NULL, NULL, NULL, 7, 0, 0);
#endif

static bool keyboard_data_is_released(const uint8_t data[INPUT_DATA_SIZE])
{
	static const uint8_t released[INPUT_DATA_SIZE] = { 0 };

	return memcmp(data, released, sizeof(released)) == 0;
}

int main(void)
{
	uint8_t current_keyboard[INPUT_DATA_SIZE] = { 0 };
	struct link_input_packet hid_pending = { 0 };
	bool hid_pending_valid = false;
	uint32_t next_keyboard_keepalive_ms = 0;
	int err;

	LOG_INF("Starting ESB-to-USB keyboard and consumer-control receiver");
	windows_led_epoch = (uint8_t)k_cycle_get_32();

	/*
	 * Enumerate USB first. A radio initialization failure must never make
	 * the HID device disappear from the host.
	 */
	err = usb_hid_initialize();
	if (err != 0) {
		LOG_ERR("USB HID initialization failed: %d", err);
		return err;
	}

	err = esb_initialize();
	if (err != 0) {
		atomic_set(&radio_init_error, err);
		LOG_ERR("ESB initialization failed: %d; USB remains available", err);
	} else {
		atomic_set(&radio_ready, 1);
		LOG_INF("Ready: ESB PRX 2 Mbps channel %u, pipe 0 address "
			"E7:E7E7E7E7, USB keyboard + Consumer Control",
			LINK_RF_CHANNEL);
	}

	for (;;) {
		struct link_input_packet queued;
		uint32_t const now = k_uptime_get_32();

		receiver_ack_task();

		if (!usb_hid_ready()) {
			/*
			 * Retain only keyboard state while the PC is absent. Consumer
			 * actions are transitions and must not be replayed later.
			 */
			while (k_msgq_get(&hid_report_queue, &queued,
					  K_NO_WAIT) == 0) {
				if (queued.type == LINK_TYPE_KEYBOARD) {
					memcpy(current_keyboard, queued.data,
					       sizeof(current_keyboard));
				}
			}
			hid_pending_valid = false;
			k_msleep(1);
			continue;
		}

		if (!keyboard_data_is_released(current_keyboard) &&
		    (uint32_t)(now -
		    (uint32_t)atomic_get(&last_keyboard_packet_ms)) >=
		    KEYBOARD_LINK_TIMEOUT_MS && !hid_pending_valid) {
			memset(current_keyboard, 0, sizeof(current_keyboard));
			atomic_set(&keyboard_watchdog_released, 1);
			hid_pending.type = LINK_TYPE_KEYBOARD;
			hid_pending.sequence = 0;
			memcpy(hid_pending.data, current_keyboard,
			       sizeof(hid_pending.data));
			hid_pending_valid = true;
		}

		if (previous_consumer_valid && (previous_consumer[0] != 0 || previous_consumer[1] != 0) &&
		    (uint32_t)(now - (uint32_t)atomic_get(&last_consumer_packet_ms)) >= 1000U && !hid_pending_valid) {
			memset(previous_consumer, 0, sizeof(previous_consumer));
			hid_pending.type = LINK_TYPE_CONSUMER;
			hid_pending.sequence = 0;
			memset(hid_pending.data, 0, sizeof(hid_pending.data));
			hid_pending_valid = true;
		}

		if (!hid_pending_valid &&
		    k_msgq_get(&hid_report_queue, &queued, K_NO_WAIT) == 0) {
			hid_pending = queued;
			hid_pending_valid = true;
			if (queued.type == LINK_TYPE_KEYBOARD) {
				memcpy(current_keyboard, queued.data,
				       sizeof(current_keyboard));
			}
		}

		if (hid_pending_valid) {
			int const send_result = hid_pending.type == LINK_TYPE_KEYBOARD ?
				send_keyboard_report(hid_pending.data) :
				send_consumer_report(hid_pending.data);

			if (send_result == 0) {
				hid_pending_valid = false;
			}
		}

		/* No blocking HID wait: let the 1 ms USB endpoint callback release the
		 * idle semaphore while the radio handler remains free to queue input. */
		k_yield();
	}
}
